---
kind: property
id: P:Autodesk.Revit.DB.Analysis.GenericZone.LevelOffset
source: html/272b69dc-740d-0edd-21f6-35d0dfeb7a88.htm
---
# Autodesk.Revit.DB.Analysis.GenericZone.LevelOffset Property

The offset distance from this zone to the associated level.

## Syntax (C#)
```csharp
public double LevelOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for offset must be no more than 30000 feet in absolute value.